/* Localized versions of Info.plist keys */

AMName = "Convert CSV to SQL (Extended)";

/*  AMApplication localized strings  */
/*  e.g. "TextEdit" = "TextEdit";  */

/*  AMCategory localized strings  */
/*  e.g. "Text" = "Text";  */

/*  AMDefaultParameters localized values  */
/*  e.g. myDefaultIntegerParameter = 0;  */
/*  e.g. myDefaultStringParameter = "Default String Value";  */

/*  AMDescription localized strings  */
AMDAlert = "";
AMDInput = "One or more files in a delimiter-separated value format.";
AMDNote = "";
AMDOptions = "Supply SQL commands to be used in place of each line of input. Also indicate whether the first line of inputs is a header containing column names. To substitute the value of a field in the current line of input, use the format {$column} where column is the field starting from 0 (zero).";
AMDResult = "Once sequence of SQL commands per input.";
AMDRequires = "";
AMDSummary = "This action converts a delimiter-separated value (CSV) input to SQL suitable for application to a database.";
AMDWebsite = "http://franzgranlund.com/csvtosql/";
AMDRelatedActions = "";

/*  AMKeyword localized strings  */
/*  e.g. "Filter" = "Filter";  */

/*  AMWarning localized strings  */
ApplyButton = "(* Button label for user to add proposed Action, e.g. Add. *)";
IgnoreButton = "(* Button label for user not to add proposed Action, e.g. Don't Add. *)";
Message = "(* Warning message presented to user goes here. *)";
